Repository: Xander-gz/QET_TerminalTableApp
Catalog: src/TerminalTableCreator/locale/*/LC_MESSAGES/TerminalTableApp.po
Languages: de

source: Instruction: Attention! The programme does not recognise formulas for assigning slide numbers (e.g. %id/%total) or equipment codes! These must be entered separately! The equipment code for the terminal strip must begin with ‘-X’. Any characters can be specified after this. The terminal designation is delimited with a ‘:’. Here, too, both letters and numbers can follow. The terminals are sorted in ascending order, with numbers before letters. Examples: ‘-XPR:1’, ‘-X312:21’ The pages are added to the project with the title Terminal diagram + slide name . Slide name K1, K2,... In terms of function, the terminal diagrams are individual elements that are also displayed in the component collection under Imported elements/Terminal diagrams. In addition, accessories are created here under /Accessories, which can be subsequently placed over the terminal diagram. The following requirements must be met for the terminals drawn in the project : - The terminals for terminal points must be given a name (a, b...) - The terminals for terminal points must be declared as internal or external. - Bridges must be declared as generic. and have no name. A bridge is recognised as such if the conductor in the text field is declared as ‘bridge e1’. ‘e1’ stands for external 1, ‘i1’ for internal 1. The following bridges can be specified: e1, e2, e3, and i3, i2, i1. Be careful when drawing terminal elements yourself. If the elements are copied or saved under a new name, the ‘uuid’ of the terminals will not be reassigned. This can lead to unexpected behaviour. Therefore, always delete the terminals and insert them again. The same applies to other elements. Cables are queried from the XML file. However, they cannot currently be specified in Qelectrotech. It is possible to add further elements, such as an image of the terminals used or comments.
de: Anleitung: Achtung! Das Programm erkennt keine Formeln für die Vergabe von Foliennummern (z.B. auto Foliennummerierung) oder Betriebsmittelkennzeichen! Diese müssen separat eingegeben werden! Das Betriebsmittelkennzeichen für die Klemmleiste muss mit -X beginnen. Dabei können nachfolgend belibige Zeichen angegeben werden. Die Abgrenzung der Klemmenbezeichnung erfolgt mit einem :. Auch hier konnen sowohl Buchstaben als auch Zahlen folgen. Eine Sortierung der Klemmen erfolgt aufsteigend, Zahlen vor Buchstaben. Beispiele: -XPR:1, -X312:21 Die Seiten werden mit dem Titel Klemmenplan + Folienname im Projekt angefügt. Folienname K1, K2,... Die Klemmenpläne sind von der Funktion her einzele Elemente, die auch in der Bauteilsammlung unter Importierte elemente/Klemmenpläne angezeigt werden. Zusätzlich werden hier unter /Zubehör Zubehörteile angelegt, die nachträglich über den Klemmenplan gelegt werden können. Bei den im Projekt eingezeichneten Klemmen müssen folgende Vorausssetzungen erfüllt sein: - die Terminals für Klemmpunkte müssen mit einem Namen versehen sein (a, b...) - die Terminals für Klemmpunkte müssen als intern oder extern deklariert sein. - Brücken müsen als generisch deklariert sein. und keinen namen haben. Eine Brücke wird als solche erkannt, wenn der Leiter im Textfeld als Brücke e1 deklariert wird. e1 steht dabei für extern 1, i1 für intern 1. Folgende Brücken können dabei angegeben werden: e1, e2, e3, und i3, i2, i1. Vorsicht beim selber Zeichnen der Klemmen-Elemente: Werden die Elemente kopiert oder geändert unter neuem Namen gespeichert, werden die uuid nicht neu vergeben. Das kann zu unerwartetem Verhalten führen. Daher die Terminals immer löschen und neu einfügen. Das selbe gilt auch für andere Elemente. Kabel werden zwar aus der XML-Datei abgefragt. Können aber zur Zeit bei Qelectrotech nicht angegeben werden. Ein Hinzufügen von weiteren Elementen wie z.B. ein Bild der verwendeten Klemmen oder von Bemerkungen ist möglich.

source: TerminalTableApp
de: KlemmenplanApp

source: The app reads a Qelectrotech file, creates a terminal diagram table, appends the table, and saves the file under a new name. Project Name is free open-source software, published under the GNU General Public Licence Version 3 (GPL-3.0). This licence permits the use, examination, modification and redistribution of the source code, provided that derivative works are also licensed under GPL v3. The full licence text can be found in the LICENCE file. Copyright © 2026 xanderhopp
de: Die App liest eine Qelectrotech-Datei aus, erstellt eine Klemmenplantabelle, fügt die Tabelle an und speichert die Datei unter neuem Namen. Projektname ist eine freie Open-Source-Software, veröffentlicht unter der GNU General Public License Version 3 (GPL-3.0). Diese Lizenz erlaubt die Nutzung, Untersuchung, Veränderung und Weiterverbreitung des Quellcodes, unter der Bedingung, dass abgeleitete Werke ebenfalls unter der GPL v3 lizenziert werden. Der vollständige Lizenztext befindet sich in der Datei LICENSE. Copyright © 2026 xanderhopp

source: Terminalblock tables for Qelectrotech
de: Klemmenpläne für Qelectrotech

source: help
de: Hilfe

source: Instruction
de: Anleitung

source: about
de: Über

source: With "Terminalblock tables for Qelectrotech" the individual terminal elements marked with "-X??:??" are sorted, assigned to the respective terminal strips, and written to a table. The tables are added to the project as new pages and saved under the name Original-file-name_terminals.qet in the same folder as the original file. The original file remains unchanged.
de: Mit Klemmenpläne für Qelectrotech werden die einzelnen mit -X??:?? gekennzeichneten Klemmenlemente sortiert, den jeweileigen Klemmleisten zugeordnet, in eine Tabelle geschrieben. Die Tabellen werden als neue Seiten an das Projekt angefügt und unter dem Originaldateinamen_terminals.qet im selben Ordner wie die Originaldatei abgespeichert. Die Originaldatei bleibt dabei unverändert.

source: choose file
de: Datei auswählen

source: chosen file:
de: Ausgewählte Datei:

source: nothing selected
de: nichts ausgewählt

source: create terminlalblock table
de: Klemmenplan erstellen

source: clear feedback
de: Rückmeldungen löschen

source: feedback comments:
de: Rückmeldungen:

source: Finisch!
de: Fertig!

source: The file
de: Die Datei

source: is successfully created.
de: wurde erfolgreich gespeichert.

source: Terminal with the same uuid available again?
de: Ein Terminal mit der selben uuid wurde nochmal verwendet?

source: No element is connected to a linked page reference?
de: An einem Seiten-Verweis ist kein Element angeschlossen?

source: Attention! All conductors carrying potential are likely to be marked as bridges!
de: Achtung! Alle Leiter des selben Potentials sind wahrscheinlich als Brücke markiert!

source: An element was labelled with -X that is not a terminal (without a named terminal).
de: Ein Element das mit -X gekennzeichnet ist, ist keine Klemme (ohne benamtes terminal)

source: Error! At terminal
de: Fehler! An Klemme

source: a connected element is not fully populated with data.
de: ein angeschlossenes Element ist nicht vollständig mit Daten versehen.

source: Error! At terminal
de: Fehler! An Klemme

source: a slave element is not linked.
de: ein Slave-Element ist nicht verlinkt.

source: Terminal strip
de: Klemmleiste

source: Terminal strip
de: Klemmleiste

source: Cables or single wires used
de: Verwendete Kabel oder Einzelader

source: Designation
de: Bezeichnung

source: Type
de: Typ

source: Cross-section
de: Qerschnitt

source: Number of wires
de: Ader-Anzahl

source: Voltage/protocol
de: Spannung/Protokoll

source: Terminal strip:
de: Klemmleiste:

source: Terminal used:
de: Verwendete Klemme:

source: Comments:
de: Bemerkungen:

source: reference
de: verweis

source: Cable
de: Kabel

source: Wire nr. / Color
de: Ader-Nr. / Farbe

source: = Plant / + Location / - Device tag / : Connection
de: = Anlage / + Ort / - BMK / : Anschluss

source: Function
de: Funktion

source: Bridge / Socket
de: Brücke / Buchse

source: externaly
de: extern

source: Terminal
de: Klemme

source: internaly
de: intern

source: Is this terminal internally and externally reversed?
de: Ist an der Klemme intern und extern vertauscht?

source: Attention! No cables stored! Wires are stored in column 1.
de: Achtung! Keine Kabel gespeichert! Die Adern werden in Spalte 1 abgelegt.

source: Error! The ‘position designation’ is incorrect at a bridge at terminal
de: Fehler! Die Positionsangabe einer Brücke ist falsch

source: It must be (1-3)e or (1-3)i.
de: Sie muss (1-3)+(e oder i) sein.
